10/data/attachments/b337c4b72bf41a24.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>James_several_Actions_99392_1</nif:username>
            <nif:friendToBeRequested>soap_actions_9770068d-1d3b-40bd-af8d-adf978f6f39a</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>